Revit 2027 API
TemporaryViewModes Methods
The TemporaryViewModes type exposes the following members.
Methods
Name | Description
DeactivateAllModes |  Deactivates all temporary modes that are currently active.
DeactivateMode |  Deactivates the given temporary mode.
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetCaption |  A text caption to use for the given mode.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCustomized |  Identifies if a custom temporary view mode is currently active. A custom mode is active if there is a non-empty string set for CustomTitle.
IsModeActive |  Tests whether a given mode is currently active or not.
IsModeAvailable |  Tests whether a temporary view mode is currently available in the associated view.
IsModeEnabled |  Tests whether a temporary view mode is currently enabled in the associated view.
IsValidState |  Tests whether the given state is valid for the associated view and the context the view is currently in.
RemoveCustomization |  Removes all customized values for the TemporaryViewProperties mode.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
TemporaryViewModes Class
Autodesk.Revit.DB Namespace